Revit 2027 API
TopographySurface.AsSiteSubRegion Method
 Obtains the subregion object represented by this element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SiteSubRegion AsSiteSubRegion()
Public Function AsSiteSubRegion As SiteSubRegion
public:
SiteSubRegion^ AsSiteSubRegion()
member AsSiteSubRegion : unit -> SiteSubRegion
Return Value
SiteSubRegion
 The SiteSubRegion element. If this does not represent a SiteSubRegion, this will be null.
Remarks
 This applies to TopographySurface and SiteSubRegion elements.
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace